<a href="https://colab.research.google.com/github/thiagocf2/PedidON/blob/master/arquivos/9_2_ConsultasWhere.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.2 CONSULTAS DAS TABELAS COM FILTROS WHERE

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [4]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [3]:
import pandas as pd
import psycopg2

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

### Conectando com o banco através do psycopg2

In [5]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com",database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## SELECT UTILIZANDO WHERE

In [10]:
query1 = pd.read_sql_query("select * from comanda where fk_id_funcionario=1", conn)

In [11]:
query1

   id_comanda  mesa        data  fk_id_cliente  fk_id_funcionario
0           1    13  2020-07-30              1                  1
1           2     1  2020-07-30              2                  1
2           7    13  2020-07-31              6                  1
3          10     4  2020-08-01              4                  1

In [14]:
query2 = pd.read_sql_query("select id_comanda from comanda where mesa=1;", conn)

In [15]:
query2

   id_comanda
0           2
1           6

In [16]:
query3 = pd.read_sql_query("select nome_cliente from cliente where id_cliente=10;", conn)

In [18]:
query3

  nome_cliente
0     Henrique

In [19]:
query4 = pd.read_sql_query("select * from item_cardapio where preco<50;", conn)

In [20]:
query4

   id_itemcardapio              nome_item  ...  fk_id_categoria fk_id_tamanho
0                5           Ilha de Socó  ...                4             2
1                6  Bons ventos te trazem  ...                2             2
2                7             Barlavento  ...                2             2
3                8          Stella Artois  ...                2             4
4                9                  Pepsi  ...                2             5
5               10             Cidade Sol  ...                2             2

[6 rows x 6 columns]